In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("people.csv")
df.head()

      Name  Age           City
0    Alice   35       New York
1      Bob   28    Los Angeles
2  Charlie   42        Chicago
3    David   33  San Francisco
4      Eva   45          Miami

In [3]:
#droping index and seting Name to new index
df = df.set_index('Name', drop=True)

In [4]:
#result
df.head()

         Age           City
Name
Alice     35       New York
Bob       28    Los Angeles
Charlie   42        Chicago
David     33  San Francisco
Eva       45          Miami

In [5]:
#sorting ascending
df.sort_values(by='Name', ascending=True, inplace=True)
df.head()

         Age     City
Name
Abigail   35   Austin
Abigail   31   Austin
Abigail   39   Denver
Abigail   39   Denver
Aiden     32  Seattle

In [6]:
#sorting descending
df.sort_values(by='Name', ascending=False, inplace=True)
df.reset_index(drop=False, inplace=True)

df.head()

      Name  Age     City
0  Abigail   35   Austin
1  Abigail   31   Austin
2  Abigail   39   Denver
3  Abigail   39   Denver
4    Aiden   32  Seattle

In [7]:
#Create a new df without Abigail
df2 = df[df.index != 'Abigail']
df2.sort_values(by='Name', ascending=True, inplace=True)
df2.head()

      Name  Age     City
0  Abigail   35   Austin
1  Abigail   31   Austin
2  Abigail   39   Denver
3  Abigail   39   Denver
4    Aiden   32  Seattle

In [10]:
#Find all Abigails that are 35
df3 = df[(df['Name'] == 'Abigail') & (df['Age'] == 35)]

df3.head()

      Name  Age    City
0  Abigail   35  Austin

In [12]:
#checking for how many dublicates there are
num_duplicate_rows = df.duplicated().sum()
num_duplicate_rows

1

In [13]:
#dropping dublicates
df = df.drop_duplicates()

In [14]:
#find uniqes
df['Name'].unique()

array(['Abigail', 'Aiden', 'Alexander', 'Alice', 'Amelia', 'Ava',
       'Benjamin', 'Bob', 'Charlie', 'Charlotte', 'Chloe', 'Daniel',
       'David', 'Eleanor', 'Ella', 'Emily', 'Emma', 'Ethan', 'Eva',
       'Evelyn', 'Fiona', 'George', 'Grace', 'Hannah', 'Harper', 'Henry',
       'Isaac', 'Jack', 'Jacob', 'James', 'Liam', 'Lily', 'Lucas', 'Lucy',
       'Mason', 'Matthew', 'Mia', 'Michael', 'Oliver', 'Olivia', 'Samuel',
       'Scarlett', 'Sofia', 'Sophia', 'Sophie', 'William'], dtype=object)

In [16]:
#print heads
for col in df.columns:
    print(col)

Name
Age
City

In [17]:
#Find all Austin residents that are 30
df4 = df[(df['City'] == 'Austin') & (df['Age'] == 30)]

df4.head()

    Name  Age    City
71  Liam   30  Austin

In [24]:
df_austin = df[df['City'] == 'Austin']
means = df_austin['Age'].mean()
print(f'The average age is: {means}')

The average age is: 32.333333333333336

In [25]:
#random salary
df5 = df
df5['Salary'] = np.random.randint(20000, 35001, df5.shape[0])
df5.head()

      Name  Age     City  Salary
0  Abigail   35   Austin   34066
1  Abigail   31   Austin   24832
2  Abigail   39   Denver   33245
4    Aiden   32  Seattle   29569
5    Aiden   34  Chicago   26481

In [32]:
#count and display
df6 = df5.groupby('City').count()
df6['Name']

City
Austin           12
Boston           12
Chicago          11
Denver           11
Houston          14
Los Angeles      11
Miami            12
New York         11
San Francisco    12
Seattle          10
Name: Name, dtype: int64

In [43]:
#all city-names, how many people live in each city and the average age for each city
#since we did the first part above we steal that first
df6['Total Residents'] = df6['Name']
#Then group by city and calculate mean
df6['Average age'] = df.groupby('City')['Age'].mean()
#then drop redundant values
df6 = df6.drop(['Name','Age','Salary'], axis=1)

In [44]:
#See the results
df6.head()

         Total Residents  Average age
City
Austin                12    32.333333
Boston                12    32.500000
Chicago               11    34.636364
Denver                11    34.090909
Houston               14    32.214286

In [47]:
df6.to_json('lines_true.json',lines=True, orient = 'records', compression = 'infer')

In [ ]:
df6.to_json('lines_false.json',lines=False, orient = 'records', compression = 'infer')